jaggies/matchbox/target/stm32f4xx/stm32f415/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SW1_Pin GPIO_PIN_13
#define SW1_GPIO_Port GPIOC
#define VCC_MON_Pin GPIO_PIN_5
#define VCC_MON_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_2
#define LED1_GPIO_Port GPIOB
#define NRF8K_RDYN_Pin GPIO_PIN_9
#define NRF8K_RDYN_GPIO_Port GPIOA
#define SW2_Pin GPIO_PIN_13
#define SW2_GPIO_Port GPIOA
#define PWR_KILL_Pin GPIO_PIN_14
#define PWR_KILL_GPIO_Port GPIOA
#define NRF8K_REQN_Pin GPIO_PIN_15
#define NRF8K_REQN_GPIO_Port GPIOA
#define NRF8K_SCK_Pin GPIO_PIN_3
#define NRF8K_SCK_GPIO_Port GPIOB
#define NRF8K_MISO_Pin GPIO_PIN_4
#define NRF8K_MISO_GPIO_Port GPIOB
#define NRF8K_MOSI_Pin GPIO_PIN_5
#define NRF8K_MOSI_GPIO_Port GPIOB
#define SD_DET_Pin GPIO_PIN_8
#define SD_DET_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
